#+TITLE: QMC-LTTC 2023 Exercises
#+AUTHOR: Vijay Gopal Chilkuri
#+LANGUAGE:  en
#+INFOJS_OPT: toc:t mouse:underline path:org-info.js
#+STARTUP: latexpreview
#+LATEX_CLASS: article
#+LATEX_HEADER_EXTRA: \usepackage{minted}
#+HTML_HEAD: <link rel="stylesheet" title="Standard" href="worg.css" type="text/css" />

#+OPTIONS: H:4 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS: TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
# EXCLUDE_TAGS: solution solution2 noexport
# EXCLUDE_TAGS: solution noexport
#+EXCLUDE_TAGS: noexport

  #+BEGIN_SRC elisp :output none :exports none
(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted"))
      org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
(setq org-latex-minted-options '(("breaklines" "true")
                                 ("breakanywhere" "true")))
(setq org-latex-minted-options
      '(("frame" "lines")
        ("fontsize" "\\scriptsize")
        ("linenos" "")))
(org-beamer-export-to-pdf)

  #+END_SRC

  #+RESULTS:
  : /home/chilkuri/Documents/codes/julia/qmc-lttc-2023/qmc_solutions.pdf



**** Solution                                                      :solution:
    *Julia*
     #+BEGIN_SRC julia :results output :exports both
using LinearAlgebra
include("hydrogen.jl");


interval = range(-5,5,length=50);
delta = (interval[2]-interval[1])^3;

r = [0.,0.,0.];
for a in [0.1, 0.2, 0.5, 0.9, 1., 1.5, 2.]
    E    = 0.;
    norm = 0.;

    for x in interval
        r[1] = x;
        for y in interval
            r[2] = y;
            for z in interval
                r[3] = z;

                w = psi(a,r);
                w = w * w * delta;

                E    += w * e_loc(a,r);
                norm += w;
            end
        end
    end
    E = E / norm;
    println("a = $(a) \t E = $(E)")
end
     #+end_src

     #+RESULTS:
     : a = 0.1 	 E = -0.24518438948809218
     : a = 0.2 	 E = -0.26966057967803525
     : a = 0.5 	 E = -0.3856357612517401
     : a = 0.9 	 E = -0.49435709786716214
     : a = 1.0 	 E = -0.5
     : a = 1.5 	 E = -0.3924296708260237
     : a = 2.0 	 E = -0.08086980667845059

*** Exercise
   #+begin_exercise
   Add the calculation of the variance to the previous code, and
   compute a numerical estimate of the variance of the local energy using
   a grid of $50\times50\times50$ points in the range $(-5,-5,-5) \le
   \mathbf{r} \le (5,5,5)$ for different values of $a$.

   #+end_exercise
     *Julia*
     #+BEGIN_SRC julia :results output :exports both
using LinearAlgebra
include("hydrogen.jl");


interval = range(-5,5,length=50);
delta = (interval[2]-interval[1])^3;

r = [0.,0.,0.];

for a in [0.1, 0.2, 0.5, 0.9, 1., 1.5, 2.]
    E    = 0.;
    E2   = 0.;
    norm = 0.;

    for x in interval
        r[1] = x;
        for y in interval
            r[2] = y;
            for z in interval
                r[3] = z;

                w = psi(a,r);
                w = w * w * delta;

                E    += w * e_loc(a,r);
                E2   += w * e_loc(a,r) * e_loc(a,r);
                norm += w;
            end
        end
    end
    E = E / norm;
    E2= E2/ norm;
    var = E2 - E*E;
    println("a = $(a) \t E = $(E) \t σ^2 = $(var)")
end
     #+end_src

     #+RESULTS:
     : a = 0.1 	 E = -0.24518438948809218 	 σ^2 = 0.026965218719722663
     : a = 0.2 	 E = -0.26966057967803525 	 σ^2 = 0.037197072370200784
     : a = 0.5 	 E = -0.3856357612517401 	 σ^2 = 0.053185967578480015
     : a = 0.9 	 E = -0.49435709786716214 	 σ^2 = 0.005778118170656099
     : a = 1.0 	 E = -0.5 	 σ^2 = 0.0
     : a = 1.5 	 E = -0.3924296708260237 	 σ^2 = 0.3144967090917285
     : a = 2.0 	 E = -0.08086980667845059 	 σ^2 = 1.806881427084649

**** Solution                                                     :solution:
    *Julia*
     #+BEGIN_SRC julia  :results output :exports both
include("hydrogen.jl");
include("qmc_stats.jl");

function MonteCarlo(a, nmax)
     energy = 0.;
     normalization = 0.;

     for istep in range(1,nmax)

         R = 5.0;
         phi = rand()*2*π;
         costheta = rand()*2 - 1.0;
         u = rand();

         theta = acos( costheta );
         r = R * cbrt( u );

         # Spherical distribution
         x = r * sin( theta) * cos( phi );
         y = r * sin( theta) * sin( phi );
         z = r * cos( theta );
         # Cuboidal distribution
         #x = 10 * rand() - 5.0;
         #y = 10 * rand() - 5.0;
         #z = 10 * rand() - 5.0;
         r = [x,y,z];

         w = psi(a,r);
         w = w*w;

         energy        += w * e_loc(a,r);
         normalization += w;
     end

     return energy / normalization
end

a    = 1.2;
nmax = 100_000;

X = [MonteCarlo(a,nmax) for i in range(1,30)];
E, deltaE = ave_error(X);

println("E = $(E) +/- $(deltaE)")
     #+END_SRC

     #+RESULTS:
     : Sphere
     : E = -0.48024356420973185 +/- 0.001321161390324179
     : Cube
     : E = -0.4787870280458861 +/- 0.0020675933699247735

**** Solution                                                     :solution:
    *Julia*
     #+BEGIN_SRC julia :results output :exports both
include("hydrogen.jl")
include("qmc_stats.jl")

function MonteCarlo(a,nmax,dt)
    energy  = 0.;
    N_accep = 0;

    x_old = rand()*2*dt - dt;
    y_old = rand()*2*dt - dt;
    z_old = rand()*2*dt - dt;
    r_old = [x_old,y_old,z_old];
    psi_old = psi(a,r_old);

    for istep in range(1,nmax)
        energy += e_loc(a,r_old);

        x_new = rand()*2*dt - dt;
        y_new = rand()*2*dt - dt;
        z_new = rand()*2*dt - dt;
        r_new = [x_new,y_new,z_new];
        r_new = r_old + r_new;
        psi_new = psi(a,r_new);

        ratio = (psi_new / psi_old)^2;

        if rand() <= ratio
            N_accep += 1;

            r_old   = r_new;
            psi_old = psi_new;
        end
    end

    return([energy/nmax, N_accep/nmax])
end

# Run simulation
a    = 1.2
nmax = 100000
dt   = 1.0

X0 = foldl(hcat,1:30 .|> x->MonteCarlo(a,nmax,dt))

# Energy
X = X0[1,:];
E, deltaE = ave_error(X)
print("E = $(E) +/- $(deltaE)")

# Acceptance rate
X = X0[2,:];
A, deltaA = ave_error(X)
print("A = $(A) +/- $(deltaA)")
     #+END_SRC

     #+RESULTS:
     : E = -0.4799712012519308 +/- 0.0004972233203530915:
     : A = 0.5076869999999999 +/- 0.0003981466113606039

**** Solution                                                      :solution:
    *Julia*
     #+BEGIN_SRC julia :results output :exports both
using LinearAlgebra
using Distributions

include("hydrogen.jl")
include("qmc_stats.jl")

function MonteCarlo(a,nmax,dt)
    sq_dt = sqrt(dt)

    energy  = 0.
    N_accep = 0

    x_old = rand()*2*dt - dt;
    y_old = rand()*2*dt - dt;
    z_old = rand()*2*dt - dt;
    r_old = [x_old,y_old,z_old];
    psi_old = psi(a,r_old);
    d_old   = drift(a,r_old)
    d2_old  = dot(d_old,d_old)

    # Normal distribution
    d = Normal(0.0,1.0);

    for istep in range(1,nmax)
        chi = rand(d,3);

        energy += e_loc(a,r_old)

        x_new = rand()*2*dt - dt;
        y_new = rand()*2*dt - dt;
        z_new = rand()*2*dt - dt;
        r_new = [x_new,y_new,z_new];
        r_new   = r_old + dt * d_old + sq_dt * chi
        d_new   = drift(a,r_new)
        d2_new  = dot(d_new,d_new)
        psi_new = psi(a,r_new)

        # Metropolis
        prod    = dot((d_new + d_old), (r_new - r_old))
        argexpo = 0.5 * (d2_new - d2_old)*dt + prod

        q = psi_new / psi_old
        q = exp(-argexpo) * q*q

        if rand() <= q
            N_accep += 1

            r_old   = r_new
            d_old   = d_new
            d2_old  = d2_new
            psi_old = psi_new
        end
    end

    return([energy/nmax, N_accep/nmax])
end


# Run simulation
a    = 1.2
nmax = 100000
dt   = 1.0

X0 = foldl(hcat,1:30 .|> x->MonteCarlo(a,nmax,dt))

# Energy
X = X0[1,:];
E, deltaE = ave_error(X)
print("E = $(E) +/- $(deltaE)")


# Acceptance rate
X = X0[2,:];
A, deltaA = ave_error(X)
print("A = $(A) +/- $(deltaA)")
     #+END_SRC

     #+RESULTS:
     : E = -0.48031432448301836 +/- 0.0004849708507147206
     : A = 0.6209063333333334 +/- 0.00043997556968053034
**** Solution                                                      :solution:

     *Julia*
     #+BEGIN_SRC julia :results output
using LinearAlgebra
using Distributions

include("hydrogen.jl")
include("qmc_stats.jl")

function MonteCarlo(a, nmax, dt, tau, Eref)
    sq_dt = sqrt(dt)

    energy  = 0.
    N_accep = 0
    normalization = 0.

    w           = 1.
    tau_current = 0.

    x_old = rand()*2*dt - dt;
    y_old = rand()*2*dt - dt;
    z_old = rand()*2*dt - dt;
    r_old = [x_old,y_old,z_old];
    d_old   = drift(a,r_old)
    d2_old  = dot(d_old,d_old)
    psi_old = psi(a,r_old)

    # Normal distribution
    d = Normal(0.0,1.0);

    for istep in range(1,nmax)
        el = e_loc(a,r_old)
        w *= exp(-dt*(el - Eref))

        normalization += w
        energy        += w * el

        tau_current += dt

        # Reset when tau is reached
        if tau_current > tau
            w           = 1.
            tau_current = 0.
        end

        chi = rand(d,3);

        x_new = rand()*2*dt - dt;
        y_new = rand()*2*dt - dt;
        z_new = rand()*2*dt - dt;
        r_new = [x_new,y_new,z_new];
        r_new = r_old + dt * d_old + sq_dt * chi
        d_new = drift(a,r_new)
        d2_new = dot(d_new,d_new)
        psi_new = psi(a,r_new)

        # Metropolis
        prod = dot((d_new + d_old), (r_new - r_old))
        argexpo = 0.5 * (d2_new - d2_old)*dt + prod

        q = psi_new / psi_old
        q = exp(-argexpo) * q*q

        if rand() <= q
            N_accep += 1
            r_old   = r_new
            d_old   = d_new
            d2_old  = d2_new
            psi_old = psi_new
        end
    end

    return([energy/normalization, N_accep/nmax])
end


# Run simulation
a     = 1.2
nmax  = 100000
dt    = 0.05
tau   = 100.
E_ref = -0.5

X0 = foldl(hcat,1:30 .|> x->MonteCarlo(a,nmax,dt,tau,E_ref))

# Energy
X = X0[1,:];
E, deltaE = ave_error(X)
print("E = $(E) +/- $(deltaE)")

# Acceptance rate
X = X0[2,:];
A, deltaA = ave_error(X)
print("A = $(A) +/- $(deltaA)")
     #+END_SRC

     #+RESULTS:
     : E = -0.4990976236303405 +/- 0.0007252894721434303
     : A = 0.9896489999999999 +/- 6.907658584964676e-5

